#1
# Control Flow — პითონში კოდის შესრულების მიმდევრობა. განსაზღვრავს რა თანმიმდევრობით სრულდება ინსტრუქციები.

# Algorithm — პითონში ნაბიჯ-ნაბიჯ დაწერილი ინსტრუქციები რომლებიც გამოიყენება რაიმე ამოცანის ამოსახსნელად.

#2
# % (ნაშთის ოპერატორი) — აბრუნებს გაყოფის შემდეგ დარჩენილ ნაშთს.

print(10 % 3)   # ნაშთი 1  
print(25 % 4)   # ნაშთი 1


# // (მთელი გაყოფა) — ასრულებს გაყოფას და აბრუნებს მხოლოდ მთელ ნაწილს.

print(10 // 3)  # 3  ნაშთი არ აქვს
print(25 // 4)  # 6  6.25 დამრგვალდება და 6 იქნება


#3
num = 18        
name = "Saba"   

result = num > 15 and name == "Saba"
print(result)   # პასუხი - True

#4
age = int(input("შეიყვანე ასაკი: "))
name = input("შეიყვანე სახელი: ")

if age > 18 or name == "Andrew":
    print("შესვლა დაშვებულია")

#5
num = 17
print(num > 18 or 2 > 1)   # True


age = 18
print(Age >= 18 and 10 == 10)  # (Age ცვლადი არ არის შექმნილი)


random = "saba"
print("saba" == random or 17 % 2 == 0)  # True



