#1
# str() ფუნქცია:
# ნებისმიერი ტიპის მონაცემს გადააქცევს ტექსტურ ფორმატად (სტრინგად)

# int() ფუნქცია:
# მონაცემს გადააქცევს მთელ რიცხვად თუ ეს გარდაქმნა შესაძლებელია

# float() ფუნქცია:
# მონაცემს გადაიყვანს ათწილად რიცხვად 


#2

# ოჯახის წევრების ასაკის შეყვანა
mom_age = int(39)     # დედაჩემის ასაკი
dad_age = int(40)     # მამაჩემის ასაკი

# 25 წლის შემდეგ რამდენი წლისები იქნებიან
print("დედაჩემი იქნება:", mom_age + 25)
print("მამაჩემი იქნება:", dad_age + 25)

#3
name=input("please enter your name:"        )

print(type(name))


#4
age=input("please enter your age:")

print(str(age))


#5

# შედარების ოპერატორების მაგალითები ცვლადებში

num1 = (5 == 5)          # == ტოლობა
num2 = (5 != 3)          # != უთოლობა
num3 = (10 > 3)          # > მეტობა
num4 = (2 < 8)           # < ნაკლებობა
num5 = (7 >= 7)          # >= მეტია ან ტოლია
num6 = (4 <= 6)          # <= ნაკლებია ან ტოლია

print(num1)
print(num2)
print(num3)
print(num4)
print(num5)
print(num6)











