#1.  კონკატინაცია ნიშნავს შეერთებას პროგრამირებაში პითონში კი უმეტესად გამოიყენება ტექსტური სტრიქონების შეერთებისას

#2.  1) text = "გამარჯობა"
#2.  2) number = 25
#2.  3) price = 19.99


#3.  1)  print(5 + 5) - გამოიტანს პასუხს რომელიცაა 10.
#3.  2)  print(83 - 69) - გამოიტანს პასუხს რომელიცაა 14.
#3.  3)  print(40 * 2) - გამოიტანს პასუხს რომელიცაა 80.
#3.  4)  print(55 / 5) - გამოიტანს პასუხს რომელიცაა 11.

print("საბა " * 20)

#5. "homework" + 5 ერორის გამო რომელი ტიპის მონაცემებია განსხვავებული და Python არ იცის როგორ უნდა დაამატოს ტექსტი და რიცხვი ერთად.
#5. "classwork" * 4 არ არის ერორი, რადგან * ნიშნავს სტრინგის გამეორებას 4-ჯერ.
 
#6 name = "student" print( name + name ) ტერმინალზე გამოიტანს studentstudent გადაბმულად

#7. number = 23 number1 = "4" print( number + number1 ) ეს გამოიტანს errors რადგან ერთი არის integer ხოლო მეორე string 


