# 1
# ფუნქცია — კოდის ნაწილი რომელიც რაღაცას აკეთებს.
# არგუმენტი — მნიშვნელობა რომელსაც ფუნქციას გადავცემთ.


# 2


# print()

# print("hi")

# print(5)

# print("saba")

# -------------------------------------------------------------------------------

# int()

# int("5")

# int(3.7)

# int("10")

# ------------------------------------------------------------------------------

# str()

# str(5)

# str(3.5)

# str(True)

# -------------------------------------------------------------------------------

# float()

# float(5)

# float("3.2")

# float(10)

# -------------------------------------------------------------------------------

# input()

# input("name: ")

# input("surname: ")

# input("age: ")

