
#1
# კარგი პრაქტიკები ნიშნავს ისეთი წესების დაცვას, 
# რომლებიც კოდს უფრო გასაგებს, მარტივად წასაკითხსა და შესანარჩუნებელს ხდის.

# მაგალითად:
# ცვლადის სახელები უნდა იყოს მკაფიო და აღწერითი
# კარგი პრაქტიკა — ცვლადის სახელი ნათლად აჩვენებს რისთვისაა მაგ: user_age=15
 # ცუდი პრაქტიკა — ცვლადის მნიშვნელობა x = 15


#2
age=12
age=13

print(age)


#3
#პითონი case sensitive არის, რადგან დიდსა და პატარა ასოებს განსხვავებულ სიმბოლოებად აღიქვამს.ანუ ცვლადები Name, name და NAME პითონში სამი განსხვავებული ცვლადია. მაგალითად რომ ჩავწეროთ print დიდი ასოებით PRINT(age) ამოაგდებს ერორს სახელათ nameerror



#4
# ორი ინტეჯერის ტიპის ცვლადის შექმნა
a = 5
b = 7

# მათი ნამრავლის შენახვა მესამე ცვლადში
product = a * b

# შედეგის დაბეჭდვა
print(product)




#5
print (7634 % 4) #ნაშთი ორი

print(982 % 3) #ნაშთი ერთი
 
print (12345 % 3) #ნაში არ იქნება



#6
name = "giorgi"
print(name)
name = "vano"
Name = "nika"
NAME = "saba"
print(Name)

#პირველად გამოიტანს სახელს giorgi
#ხოლო მეორეში გამოიტანს nika-ს

#7
age = 23
print(age)

num = 34
print(num + 5)    

print("5" *  3) #წესით ყველაფერი სწორია



